ZeroZap/xhsc/HC32L021/driver/src/hc32l021_atim3.c
/**
 *******************************************************************************
 * @file  atim3.c
 * @brief This file provides firmware functions to manage the ADC
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-18       MADS            First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32l021_atim3.h"

/**
 * @addtogroup HC32L021_DDL 驱动库
 * @{
 */

/**
 * @defgroup DDL_ATIM3 ATIM3模块驱动库
 * @brief ATIM3 Driver Library ADC模块驱动库
 * @{
 */
/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/
/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ATIM3_Global_Functions ATIM3全局函数定义
 * @{
 */

/**
 * @brief  ATIM3 初始化配置(模式0)
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_mode0_init_t
 * @retval None
 */
void ATIM3_Mode0_Init(stc_atim3_mode0_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE0->M0CR,
               ATIM3_MODE0_M0CR_MODE | ATIM3_MODE0_M0CR_GATEP | ATIM3_MODE0_M0CR_GATE | ATIM3_MODE0_M0CR_PRS | ATIM3_MODE0_M0CR_TOGEN | ATIM3_MODE0_M0CR_CT
                   | ATIM3_MODE0_M0CR_MD,
               pstcCfg->u32WorkMode | pstcCfg->u32GatePolar | pstcCfg->u32EnGate | pstcCfg->u32PRS | pstcCfg->u32EnTog | pstcCfg->u32CountClockSelect
                   | pstcCfg->u32CountMode);
}

/**
 * @brief  ATIM3 模式0 启动运行
 * @retval None
 */
void ATIM3_Mode0_Run(void)
{
    SET_REG_BIT(ATIM3_MODE0->M0CR, ATIM3_MODE0_M0CR_CTEN);
}

/**
 * @brief  ATIM3 模式0 停止运行
 * @retval None
 */
void ATIM3_Mode0_Stop(void)
{
    CLR_REG_BIT(ATIM3_MODE0->M0CR, ATIM3_MODE0_M0CR_CTEN);
}

/**
 * @brief  ATIM3 模式0 重载值设置
 * @param  [in] u16Data 16bits重载值
 * @retval None
 */
void ATIM3_Mode0_ARRSet(uint32_t u16Data)
{
    WRITE_REG(ATIM3_MODE0->ARR, (u16Data & 0xFFFFu));
}

/**
 * @brief  ATIM3 模式0 获取重载值
 * @retval uint32_t 16bits重载值
 */
uint32_t ATIM3_Mode0_ARRGet(void)
{
    return ((READ_REG(ATIM3_MODE0->ARR)) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式0 16位计数器初值设置
 * @param  [in] u16Data CNT 16位初值
 * @retval None
 */
void ATIM3_Mode0_Cnt16Set(uint32_t u16Data)
{
    WRITE_REG(ATIM3_MODE0->CNT, (u16Data & 0xFFFFu));
}

/**
 * @brief  ATIM3 模式0 16位计数值获取
 * @retval uint32_t 16bits计数值
 */
uint32_t ATIM3_Mode0_Cnt16Get(void)
{
    return ((READ_REG(ATIM3_MODE0->CNT)) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式0 32位计数器初值设置
 * @param  [in] u32Data 32位初值
 * @retval None
 */
void ATIM3_Mode0_Cnt32Set(uint32_t u32Data)
{
    WRITE_REG(ATIM3_MODE0->CNT32, u32Data);
}

/**
 * @brief  ATIM3 模式0 32位计数值获取
 * @retval uint32_t 32bits计数值
 */
uint32_t ATIM3_Mode0_Cnt32Get(void)
{
    return (READ_REG(ATIM3_MODE0->CNT32));
}

/**
 * @brief  ATIM3 模式0端口输出使能
 * @retval None
 */
void ATIM3_Mode0_OutputEnable(void)
{
    SET_REG32_BIT(ATIM3_MODE0->DTR, ATIM3_MODE0_DTR_MOE);
}
/**
 * @brief  ATIM3 模式0端口输出禁止
 * @retval None
 */
void ATIM3_Mode0_OutputDisable(void)
{
    CLR_REG16_BIT(ATIM3_MODE0->DTR, ATIM3_MODE0_DTR_MOE);
}

/**
 * @brief  ATIM3 模式0翻转使能
 * @retval None
 */
void ATIM3_Mode0_TOGEnable(void)
{
    SET_REG32_BIT(ATIM3_MODE0->M0CR, ATIM3_MODE0_M0CR_TOGEN);
}

/**
 * @brief  ATIM3 模式0翻转禁止
 * @retval None
 */
void ATIM3_Mode0_TOGDisable(void)
{
    CLR_REG32_BIT(ATIM3_MODE0->M0CR, ATIM3_MODE0_M0CR_TOGEN);
}
/**
 * @brief  ATIM3 模式1 初始化配置
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_mode1_init_t
 * @retval None
 */
void ATIM3_Mode1_Init(stc_atim3_mode1_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE1->M1CR, ATIM3_MODE1_M1CR_MODE | ATIM3_MODE1_M1CR_PRS | ATIM3_MODE1_M1CR_CT | ATIM3_MODE1_M1CR_ONESHOT,
               pstcCfg->u32WorkMode | pstcCfg->u32PRS | pstcCfg->u32CountClockSelect | pstcCfg->u32ShotMode);
}

/**
 * @brief  ATIM3 模式1 PWC 输入配置
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_pwc_input_init_t
 * @retval None
 */
void ATIM3_Mode1_InputConfig(stc_atim3_pwc_input_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE1->MSCR, ATIM3_MODE1_MSCR_TS | ATIM3_MODE1_MSCR_IA0S | ATIM3_MODE1_MSCR_IB0S,
               pstcCfg->u32IA0Select | pstcCfg->u32IB0Select | pstcCfg->u32TsSelect);

    if (ATIM3_M1_FLTR_FLTA0_B0_ET_NONE != pstcCfg->u32FltIA0)
    {
        SET_REG_BIT(ATIM3_MODE1->CR0, ATIM3_MODE1_CR0_CSA);
    }
    if (ATIM3_M1_FLTR_FLTA0_B0_ET_NONE != pstcCfg->u32FltIB0)
    {
        SET_REG_BIT(ATIM3_MODE1->CR0, ATIM3_MODE1_CR0_CSB);
    }

    MODIFY_REG(ATIM3_MODE1->FLTR, ATIM3_MODE1_FLTR_FLTA0 | ATIM3_MODE1_FLTR_FLTB0 | ATIM3_MODE1_FLTR_FLTET | ATIM3_MODE1_FLTR_ETP,
               pstcCfg->u32FltIA0 | (pstcCfg->u32FltIB0 << ATIM3_MODE1_FLTR_FLTB0_Pos) | (pstcCfg->u32FltETR << ATIM3_MODE1_FLTR_FLTET_Pos) | pstcCfg->u32ETR);
}

/**
 * @brief  ATIM3 模式1 PWC测量边沿起始结束选择(周期)
 * @param  [in] u32DetectEdgeSel 测量起始和结束边沿选择 @ref ATIM3_Mode1_PWC_Start_End_Edge
 * @retval None
 */
void ATIM3_Mode1_PWCEdgeSelect(uint32_t u32DetectEdgeSel)
{
    MODIFY_REG(ATIM3_MODE1->M1CR, ATIM3_MODE1_M1CR_EDG2ND | ATIM3_MODE1_M1CR_EDG1ST, u32DetectEdgeSel);
}

/**
 * @brief  ATIM3 模式1 启动运行
 * @retval None
 */
void ATIM3_Mode1_Run(void)
{
    SET_REG_BIT(ATIM3_MODE1->M1CR, ATIM3_MODE1_M1CR_CTEN);
}

/**
 * @brief  ATIM3 模式1 停止运行
 * @retval None
 */
void ATIM3_Mode1_Stop(void)
{
    CLR_REG_BIT(ATIM3_MODE1->M1CR, ATIM3_MODE1_M1CR_CTEN);
}

/**
 * @brief  ATIM3 模式1 16位计数器初值设置
 * @param  [in] u16Data CNT 16位初值
 * @retval None
 */
void ATIM3_Mode1_Cnt16Set(uint32_t u16Data)
{
    WRITE_REG(ATIM3_MODE1->CNT, (u16Data & 0xFFFFu));
}

/**
 * @brief  ATIM3 模式1 16位计数值获取
 * @retval uint32_t 16bits计数值
 */
uint32_t ATIM3_Mode1_Cnt16Get(void)
{
    return ((READ_REG(ATIM3_MODE1->CNT)) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式1 脉冲宽度测量结果数值获取
 * @retval uint32_t 16bits脉冲宽度测量结果
 */
uint32_t ATIM3_Mode1_PWCCapValueGet(void)
{
    return ((READ_REG(ATIM3_MODE1->CCR0A)) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式23 初始化配置
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_mode23_init_t
 * @retval None
 */
void ATIM3_Mode23_Init(stc_atim3_mode23_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->M23CR,
               ATIM3_MODE23_M23CR_MODE | ATIM3_MODE23_M23CR_DIR | ATIM3_MODE23_M23CR_PRS | ATIM3_MODE23_M23CR_CT | ATIM3_MODE23_M23CR_COMP
                   | ATIM3_MODE23_M23CR_PWM2S | ATIM3_MODE23_M23CR_ONESHOT | ATIM3_MODE23_M23CR_URS,
               pstcCfg->u32WorkMode | pstcCfg->u32CountDir | pstcCfg->u32PRS | pstcCfg->u32CountClockSelect | pstcCfg->u32PWMTypeSelect
                   | pstcCfg->u32PWM2sSelect | pstcCfg->u32ShotMode | pstcCfg->u32URSSelect);
}

/**
 * @brief  ATIM3 模式23 启动运行
 * @retval None
 */
void ATIM3_Mode23_Run(void)
{
    SET_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_CTEN);
}

/**
 * @brief  ATIM3 模式23 停止运行
 * @retval None
 */
void ATIM3_Mode23_Stop(void)
{
    CLR_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_CTEN);
}

/**
 * @brief  ATIM3 模式23 手动PWM输出使能
 * @retval None
 */
void ATIM3_Mode23_ManualPWMOutputEnable(void)
{
    SET_REG_BIT(ATIM3_MODE23->DTR, ATIM3_MODE23_DTR_MOE);
}

/**
 * @brief  ATIM3 模式23 手动PWM输出禁止
 * @retval None
 */
void ATIM3_Mode23_ManualPWMOutputDisable(void)
{
    CLR_REG_BIT(ATIM3_MODE23->DTR, ATIM3_MODE23_DTR_MOE);
}

/**
 * @brief  ATIM3 模式23 自动PWM输出使能
 * @retval None
 */
void ATIM3_Mode23_AutoPWMOutputEnable(void)
{
    SET_REG_BIT(ATIM3_MODE23->DTR, ATIM3_MODE23_DTR_AOE);
}

/**
 * @brief  ATIM3 模式23 自动PWM输出禁止
 * @retval None
 */
void ATIM3_Mode23_AutoPWMOutputDisable(void)
{
    CLR_REG_BIT(ATIM3_MODE23->DTR, ATIM3_MODE23_DTR_AOE);
}

/**
 * @brief  ATIM3 模式23 重载(周期)缓存使能
 * @retval None
 */
void ATIM3_Mode23_ARRBufferEnable(void)
{
    SET_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_BUFPEN);
}

/**
 * @brief  ATIM3 模式23 重载(周期)缓存禁止
 * @retval None
 */
void ATIM3_Mode23_ARRBufferDisable(void)
{
    CLR_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_BUFPEN);
}

/**
 * @brief  ATIM3 模式23 重载值设置
 * @param  [in] u16Data 16bits重载值
 * @retval None
 */
void ATIM3_Mode23_ARRSet(uint16_t u16Data)
{
    WRITE_REG(ATIM3_MODE23->ARR, (u16Data & 0xFFFFu));
}

/**
 * @brief  ATIM3 模式23 重载值获取
 * @retval uint32_t: 16bit重载值
 */
uint32_t ATIM3_Mode23_GetARR(void)
{
    return ((READ_REG(ATIM3_MODE23->ARR)) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式23 16位计数器初值设置
 * @param  [in] u16Data 16位初值
 * @retval None
 */
void ATIM3_Mode23_Cnt16Set(uint16_t u16Data)
{
    WRITE_REG(ATIM3_MODE23->CNT, (u16Data & 0xFFFFu));
}

/**
 * @brief  ATIM3 模式23 16位计数值获取
 * @retval uint32_t: 16bits计数值
 */
uint32_t ATIM3_Mode23_Cnt16Get(void)
{
    return ((READ_REG(ATIM3_MODE23->CNT)) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式23 通道CHxA/CHxB比较值设置(CCRxA/CCRxB/CCR)
 * @param  [in] u32Channel ATIM3 通道 @ref ATIM3_Mode23_CCRxx_Channel
 * @param  [in] u16Data CCRxA/CCRxB 16位比较值
 * @retval None
 */
void ATIM3_Mode23_ChannelCompareValueSet(uint32_t u32Channel, uint16_t u16Data)
{
    WRITE_REG(*(&ATIM3_MODE23->CCR0A + u32Channel), (u16Data & 0xFFFFu));
}

/**
 * @brief  ATIM3 模式23 通道CHxA/CHxB捕获值读取、CCR3寄存器值读取(CCRxA/CCRxB/CCR3)
 * @param  [in] u32Channel ATIM3 通道 @ref ATIM3_Mode23_CCRxx_Channel
 * @retval uint32_t 16 bits CCRxA/CCRxB捕获值
 */
uint32_t ATIM3_Mode23_ChannelCaptureValueGet(uint32_t u32Channel)
{
    return ((READ_REG(*(&ATIM3_MODE23->CCR0A + u32Channel))) & 0xFFFFu);
}

/**
 * @brief  ATIM3 模式23 PWM互补输出模式下，GATE功能选择,只有在PWM互补输出时有效
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_gate_init_t
 * @retval None
 */
void ATIM3_Mode23_GateFuncSel(stc_atim3_m23_gate_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_CSG | ATIM3_MODE23_M23CR_CRG | ATIM3_MODE23_M23CR_CFG,
               pstcCfg->u32GateFuncSelect | pstcCfg->u32GateRiseCap | pstcCfg->u32GateFallCap);
}

/**
 * @brief  ATIM3 模式23 主从触发配置
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_master_slave_init_t
 * @retval None
 */
void ATIM3_Mode23_MasterSlaveTrigSet(stc_atim3_m23_master_slave_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->MSCR, ATIM3_MODE23_MSCR_MSM | ATIM3_MODE23_MSCR_MMS | ATIM3_MODE23_MSCR_SMS | ATIM3_MODE23_MSCR_TS,
               pstcCfg->u32MasterSlaveSelect | pstcCfg->u32MasterSrc | pstcCfg->u32SlaveModeSelect | pstcCfg->u32TsSelect);
}

/**
 * @brief  ATIM3 模式23 IA0输入选择
 * @param  [in] u32Ia0Sel CH0A输入通道选择 @ref ATIM3_Mode23_IA0_IN_Sel
 * @retval None
 */
void ATIM3_Mode23_MSCRIA0Sel(uint32_t u32Ia0Sel)
{
    MODIFY_REG(ATIM3_MODE23->MSCR, ATIM3_MODE23_MSCR_IA0S, u32Ia0Sel);
}

/**
 * @brief  ATIM3 模式23 IB0输入选择
 * @param  [in] u32Ib0Sel CH0B输入通道选择 @ref ATIM3_Mode23_IB0_IN_Sel
 * @retval None
 */
void ATIM3_Mode23_MSCRIB0Sel(uint32_t u32Ib0Sel)
{
    MODIFY_REG(ATIM3_MODE23->MSCR, ATIM3_MODE23_MSCR_IB0S, u32Ib0Sel);
}

/**
 * @brief  ATIM3 模式23 通道0/1/2 CHxA输出设置
 * @param  [in] u32Channel 通道序号 @ref ATIM3_Mode23_CH_Sel
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_compare_init_t
 * @retval None
 */
void ATIM3_Mode23_PortOutputCHxAConfig(uint32_t u32Channel, stc_atim3_m23_compare_init_t *pstcCfg)
{
    MODIFY_REG(*(&ATIM3_MODE23->CRCH0 + u32Channel), ATIM3_MODE23_CRCH0_CSA | ATIM3_MODE23_CRCH0_BUFEA,
               pstcCfg->u32CHxCompareCap | pstcCfg->u32CHxCompareBufEn);

