ZeroZap/xhsc/HC32L021/driver/src/hc32l021_atim3.c
    MODIFY_REG(ATIM3_MODE23->FLTR,
               (ATIM3_MODE23_FLTR_OCMA0_FLTA0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos))
                   | (ATIM3_MODE23_FLTR_CCPA0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)),
               (pstcCfg->u32CHxCompareModeCtrl << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos))
                   | (pstcCfg->u32CHxPolarity << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)));

    MODIFY_REG(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_CIS, pstcCfg->u32CHxCompareIntSelect);
}

/**
 * @brief  ATIM3 模式23 通道0/1/2 CHxB输出设置
 * @param  [in] u32Channel 通道序号 @ref ATIM3_Mode23_CH_Sel
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_compare_init_t
 * @retval None
 */
void ATIM3_Mode23_PortOutputCHxBConfig(uint32_t u32Channel, stc_atim3_m23_compare_init_t *pstcCfg)
{
    MODIFY_REG(*(&ATIM3_MODE23->CRCH0 + u32Channel), ATIM3_MODE23_CRCH0_CSB | ATIM3_MODE23_CRCH0_BUFEB | ATIM3_MODE23_CRCH0_CISB,
               (pstcCfg->u32CHxCompareCap << 1) | (pstcCfg->u32CHxCompareBufEn << 1) | pstcCfg->u32CHxCompareIntSelect);

    MODIFY_REG(ATIM3_MODE23->FLTR,
               (ATIM3_MODE23_FLTR_OCMB0_FLTB0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos))
                   | (ATIM3_MODE23_FLTR_CCPB0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)),
               (pstcCfg->u32CHxCompareModeCtrl << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos + ATIM3_MODE23_FLTR_OCMB0_FLTB0_Pos))
                   | (pstcCfg->u32CHxPolarity << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos + ATIM3_MODE23_FLTR_OCMB0_FLTB0_Pos)));
}

/**
 * @brief  ATIM3 模式23 通道0/1/2 CHxA输入设置
 * @param  [in] u32Channel 通道序号 @ref ATIM3_Mode23_CH_Sel
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_input_init_t
 * @retval None
 */
void ATIM3_Mode23_PortInputCHxAConfig(uint32_t u32Channel, stc_atim3_m23_input_init_t *pstcCfg)
{
    MODIFY_REG(*(&ATIM3_MODE23->CRCH0 + u32Channel), ATIM3_MODE23_CRCH0_CSA | ATIM3_MODE23_CRCH0_CFA_CRA_BKSA,
               pstcCfg->u32CHxCompareCap | pstcCfg->u32CHxCaptureSelect);

    MODIFY_REG(ATIM3_MODE23->FLTR,
               (ATIM3_MODE23_FLTR_OCMA0_FLTA0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos))
                   | (ATIM3_MODE23_FLTR_CCPA0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)),
               (pstcCfg->u32CHxInFlt << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos))
                   | (pstcCfg->u32CHxPolarity << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)));
}

/**
 * @brief  ATIM3 模式23 通道0/1/2 CHxB输入设置
 * @param  [in] u32Channel 通道序号 @ref ATIM3_Mode23_CH_Sel
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_input_init_t
 * @retval None
 */
void ATIM3_Mode23_PortInputCHxBConfig(uint32_t u32Channel, stc_atim3_m23_input_init_t *pstcCfg)
{
    MODIFY_REG(*(&ATIM3_MODE23->CRCH0 + u32Channel), ATIM3_MODE23_CRCH0_CSB | ATIM3_MODE23_CRCH0_CFB_CRB_BKSB,
               (pstcCfg->u32CHxCompareCap << 1) | (pstcCfg->u32CHxCaptureSelect << ATIM3_MODE23_CRCH0_CFB_CRB_BKSB_Msk));

    MODIFY_REG(ATIM3_MODE23->FLTR,
               (ATIM3_MODE23_FLTR_OCMB0_FLTB0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos))
                   | (ATIM3_MODE23_FLTR_CCPB0 << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos)),
               (pstcCfg->u32CHxInFlt << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos + ATIM3_MODE23_FLTR_OCMB0_FLTB0_Pos))
                   | (pstcCfg->u32CHxPolarity << (u32Channel * ATIM3_MODE23_FLTR_OCMA1_FLTA1_Pos + ATIM3_MODE23_FLTR_OCMB0_FLTB0_Pos)));
}

/**
 * @brief  ATIM3 模式23 ERT输入控制
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_etr_input_init_t
 * @retval None
 */
void ATIM3_Mode23_ETRInputConfig(stc_atim3_m23_etr_input_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->FLTR, ATIM3_MODE23_FLTR_ETP | ATIM3_MODE23_FLTR_FLTET,
               pstcCfg->u32ETRPolarity | (pstcCfg->u32ETRFlt << ATIM3_MODE23_FLTR_FLTET_Pos));
}

/**
 * @brief  ATIM3 模式23 刹车BK输入控制
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_bk_input_init_t
 * @retval None
 */
void ATIM3_Mode23_BrakeInputConfig(stc_atim3_m23_bk_input_init_t *pstcBkCfg)
{
    MODIFY_REG(ATIM3_MODE23->DTR, ATIM3_MODE23_DTR_BKE | ATIM3_MODE23_DTR_VCE | ATIM3_MODE23_DTR_SAFEEN,
               pstcBkCfg->u32EnBrake | pstcBkCfg->u32EnVCBrake | pstcBkCfg->u32EnSafetyBk);

    MODIFY_REG(ATIM3_MODE23->FLTR, ATIM3_MODE23_FLTR_BKP | ATIM3_MODE23_FLTR_FLTBK,
               pstcBkCfg->u32BrakePolarity | (pstcBkCfg->u32BrakeFlt << ATIM3_MODE23_FLTR_FLTBK_Pos));
}

/**
 * @brief  ATIM3 模式23 刹车BK端口状态控制
 * @param  [in] u32Channel    通道序号 @ref ATIM3_Mode23_CH_Sel
 * @param  [in] u32ChxaStatus CHxA端口 @ref ATIM3_Mode23_Brake_Port_Out_Level
 * @param  [in] u32ChxbStatus CHxB端口 @ref ATIM3_Mode23_Brake_Port_Out_Level
 * @retval None
 */
void ATIM3_Mode23_BrakePortStatusConfig(uint32_t u32Channel, uint32_t u32ChxaStatus, uint32_t u32ChxbStatus)
{
    MODIFY_REG(*(&ATIM3_MODE23->CRCH0 + u32Channel), ATIM3_MODE23_CRCH0_CFA_CRA_BKSA | ATIM3_MODE23_CRCH0_CFB_CRB_BKSB,
               u32ChxaStatus | (u32ChxbStatus << ATIM3_MODE23_CRCH0_CFB_CRB_BKSB_Msk));
}

/**
 * @brief  ATIM3 模式23 死区功能
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_dt_init_t
 * @retval None
 */
void ATIM3_Mode23_DTConfig(stc_atim3_m23_dt_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->DTR, ATIM3_MODE23_DTR_DTEN | ATIM3_MODE23_DTR_DTR,
               (((uint32_t)pstcCfg->bEnDeadTime) << ATIM3_MODE23_DTR_DTEN_Pos) | (pstcCfg->u32DeadTimeValue & 0xFF));
}

/**
 * @brief  ATIM3 模式23 触发ADC控制
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_adc_trig_init_t
 * @retval None
 */
void ATIM3_Mode23_TrigADCConfig(stc_atim3_m23_adc_trig_init_t *pstcCfg)
{
    MODIFY_REG(
        ATIM3_MODE23->ADTR,
        ATIM3_MODE23_ADTR_ADTE | ATIM3_MODE23_ADTR_UEVE | ATIM3_MODE23_ADTR_CMA0E | ATIM3_MODE23_ADTR_CMA1E | ATIM3_MODE23_ADTR_CMA2E | ATIM3_MODE23_ADTR_CMB0E
            | ATIM3_MODE23_ADTR_CMB1E | ATIM3_MODE23_ADTR_CMB2E,
        ((uint32_t)pstcCfg->bEnTrigADC) << ATIM3_MODE23_ADTR_ADTE_Pos | ((uint32_t)pstcCfg->bEnUevTrigADC) << ATIM3_MODE23_ADTR_UEVE_Pos
            | ((uint32_t)pstcCfg->bEnCH0ACmpTrigADC) << ATIM3_MODE23_ADTR_CMA0E_Pos | ((uint32_t)pstcCfg->bEnCH0BCmpTrigADC) << ATIM3_MODE23_ADTR_CMB0E_Pos
            | ((uint32_t)pstcCfg->bEnCH1ACmpTrigADC) << ATIM3_MODE23_ADTR_CMA1E_Pos | ((uint32_t)pstcCfg->bEnCH1BCmpTrigADC) << ATIM3_MODE23_ADTR_CMB1E_Pos
            | ((uint32_t)pstcCfg->bEnCH2ACmpTrigADC) << ATIM3_MODE23_ADTR_CMA2E_Pos | ((uint32_t)pstcCfg->bEnCH2BCmpTrigADC) << ATIM3_MODE23_ADTR_CMB2E_Pos);
}

/**
 * @brief  ATIM3 模式23 重复周期设置
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_rcr_init_t
 * @retval None
 */
void ATIM3_Mode23_SetRepeatPeriod(stc_atim3_m23_rcr_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->RCR, ATIM3_MODE23_RCR_UND | ATIM3_MODE23_RCR_OV | ATIM3_MODE23_RCR_RCR,
               pstcCfg->u32EnUnderFlowMask | pstcCfg->u32EnOverFLowMask | pstcCfg->u32RepeatCountNum);
}

/**
 * @brief  ATIM3 模式23 OCREF清除功能
 * @param  [in] pstcCfg 初始化配置结构体指针 @ref stc_atim3_m23_ocref_clr_init_t
 * @retval None
 */
void ATIM3_Mode23_OCRefClr(stc_atim3_m23_ocref_clr_init_t *pstcCfg)
{
    MODIFY_REG(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_OCCE | ATIM3_MODE23_M23CR_OCCS,
               ((uint32_t)pstcCfg->u32OCRefClearSrcSelect) << ATIM3_MODE23_M23CR_OCCE_Pos | pstcCfg->u32OCRefClearSrcSelect);
}

/**
 * @brief  ATIM3 模式23 CH0A通道0A捕获比较软件触发
 * @retval None
 */
void ATIM3_Mode23_EnableCH0ASwTrigCaptureCompare(void)
{
    SET_REG_BIT(ATIM3_MODE23->CRCH0, ATIM3_MODE23_CRCH0_CCGA);
}

/**
 * @brief  ATIM3 模式23 CH0B通道0B捕获比较软件触发
 * @retval None
 */
void ATIM3_Mode23_EnableCH0BSwTrigCaptureCompare(void)
{
    SET_REG_BIT(ATIM3_MODE23->CRCH0, ATIM3_MODE23_CRCH0_CCGB);
}

/**
 * @brief  ATIM3 模式23 CH1A通道1A捕获比较软件触发
 * @retval None
 */
void ATIM3_Mode23_EnableCH1ASwTrigCaptureCompare(void)
{
    SET_REG_BIT(ATIM3_MODE23->CRCH1, ATIM3_MODE23_CRCH1_CCGA);
}

/**
 * @brief  ATIM3 模式23 CH1B通道1B捕获比较软件触发
 * @retval None
 */
void ATIM3_Mode23_EnableCH1BSwTrigCaptureCompare(void)
{
    SET_REG_BIT(ATIM3_MODE23->CRCH1, ATIM3_MODE23_CRCH1_CCGB);
}

/**
 * @brief  ATIM3 模式23 CH2A通道2A捕获比较软件触发
 * @retval None
 */
void ATIM3_Mode23_EnableCH2ASwTrigCaptureCompare(void)
{
    SET_REG_BIT(ATIM3_MODE23->CRCH2, ATIM3_MODE23_CRCH2_CCGA);
}

/**
 * @brief  ATIM3 模式23 CH2B通道2B捕获比较软件触发
 * @retval None
 */
void ATIM3_Mode23_EnableCH2BSwTrigCaptureCompare(void)
{
    SET_REG_BIT(ATIM3_MODE23->CRCH2, ATIM3_MODE23_CRCH2_CCGB);
}

/**
 * @brief  ATIM3 模式23 软件更新使能
 * @retval None
 */
void ATIM3_Mode23_EnableSoftwareUev(void)
{
    SET_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_UG);
}

/**
 * @brief  ATIM3 模式23 软件触发使能
 * @retval None
 */
void ATIM3_Mode23_EnableSoftwareTrig(void)
{
    SET_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_TG);
}

/**
 * @brief  ATIM3 模式23 软件刹车使能
 * @retval None
 */
void ATIM3_Mode23_EnableSoftwareBrake(void)
{
    SET_REG_BIT(ATIM3_MODE23->M23CR, ATIM3_MODE23_M23CR_BG);
}

/**
 * @brief  ATIM3 模式23 获取模式0/1/2/3 中断标志
 * @param  u32InterruptFlagTypes ATIMx中断标志类型 @ref ATIM3_INT_Status_Flags
 * @retval boolean_t
 *           - TRUE: 中断标志置位
 *           - FALSE: 中断标志未置位
 */
boolean_t ATIM3_IntFlagGet(uint32_t u32InterruptFlagTypes)
{
    return READ_REG32_BIT(ATIM3_MODE23->IFR, u32InterruptFlagTypes) ? TRUE : FALSE;
}

/**
 * @brief  ATIM3 模式23 清除模式0/1/2/3 中断标志
 * @param  u32InterruptFlagTypes ATIMx中断标志类型 @ref ATIM3_INT_Status_Flags
 * @retval None
 */
void ATIM3_IntFlagClear(uint32_t u32InterruptFlagTypes)
{
    CLR_REG_BIT(ATIM3_MODE23->ICLR, u32InterruptFlagTypes);
}

/**
 * @brief  ATIM3 模式23 中断所有标志清除
 * @retval None
 */
void ATIM3_IntFlagClearAll(void)
{
    CLR_REG_BIT(ATIM3_MODE23->ICLR, 0x7FFFDu);
}

/**
 * @brief  ATIM3 模式0 中断使能
 * @retval None
 */
void ATIM3_Mode0_IntEnable(void)
{
    SET_REG_BIT(ATIM3_MODE0->M0CR, ATIM3_MODE0_M0CR_UIE);
}

/**
 * @brief  ATIM3 模式0 中断禁止
 * @retval None
 */
void ATIM3_Mode0_IntDisable(void)
{
    CLR_REG_BIT(ATIM3_MODE0->M0CR, ATIM3_MODE0_M0CR_UIE);
}

/**
 * @brief  ATIM3 模式1 中断使能
 * @param  u32InterruptTypes 中断类型 @ref ATIM3_Mode1_INT_Request
 * @retval None
 */
void ATIM3_Mode1_IntEnable(uint32_t u32InterruptTypes)
{
    if (u32InterruptTypes & ATIM3_M1_INT_UI)
    {
        SET_REG_BIT(ATIM3_MODE1->M1CR, ATIM3_MODE1_M1CR_UIE);
    }
    if (u32InterruptTypes & ATIM3_M1_INT_CA0)
    {
        SET_REG_BIT(ATIM3_MODE1->CR0, ATIM3_MODE1_CR0_CIEA);
    }
}

/**
 * @brief  ATIM3 模式1 中断禁止
 * @param  u32InterruptTypes 中断类型 @ref ATIM3_Mode1_INT_Request
 * @retval None
 */
void ATIM3_Mode1_IntDisable(uint32_t u32InterruptTypes)
{
    if (u32InterruptTypes & ATIM3_M1_INT_UI)
    {
        CLR_REG_BIT(ATIM3_MODE1->M1CR, ATIM3_MODE1_M1CR_UIE);
    }
    if (u32InterruptTypes & ATIM3_M1_INT_CA0)
    {
        CLR_REG_BIT(ATIM3_MODE1->CR0, ATIM3_MODE1_CR0_CIEA);
    }
}

/**
 * @brief  ATIM3 模式23 中断使能
 * @param  u32InterruptTypes 中断类型 @ref ATIM3_Mode23_INT_Request
 * @retval None
 */
void ATIM3_Mode23_IntEnable(uint32_t u32InterruptTypes)
{
    uint32_t u32Types = 0;

    if (INTERRUPT_M23CR_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_M23CR_MASK;
        SET_REG_BIT(ATIM3_MODE23->M23CR, u32Types);
    }

    if (INTERRUPT_CRCH0_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_CRCH0_MASK;
        SET_REG_BIT(ATIM3_MODE23->CRCH0, u32Types);
    }

