ZeroZap/xhsc/HC32L021/driver/src/hc32l021_atim3.c
    if (INTERRUPT_CRCH1_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_CRCH1_MASK;
        SET_REG_BIT(ATIM3_MODE23->CRCH1, u32Types << 2);
    }

    if (INTERRUPT_CRCH2_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_CRCH2_MASK;
        SET_REG_BIT(ATIM3_MODE23->CRCH2, u32Types << 4);
    }
}

/**
 * @brief  ATIM3 模式23 中断禁止
 * @param  u32InterruptTypes 中断类型 @ref ATIM3_Mode23_INT_Request
 * @retval None
 */
void ATIM3_Mode23_IntDisable(uint32_t u32InterruptTypes)
{
    uint32_t u32Types = 0;

    if (INTERRUPT_M23CR_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_M23CR_MASK;
        CLR_REG_BIT(ATIM3_MODE23->M23CR, u32Types);
    }

    if (INTERRUPT_CRCH0_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_CRCH0_MASK;
        CLR_REG_BIT(ATIM3_MODE23->CRCH0, u32Types);
    }

    if (INTERRUPT_CRCH1_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_CRCH1_MASK;
        CLR_REG_BIT(ATIM3_MODE23->CRCH1, u32Types << 2);
    }

    if (INTERRUPT_CRCH2_ID & u32InterruptTypes)
    {
        u32Types = u32InterruptTypes & INTERRUPT_CRCH2_MASK;
        CLR_REG_BIT(ATIM3_MODE23->CRCH2, u32Types << 4);
    }
}

/**
 * @brief  模式0结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_atim3_mode0_init_t
 * @retval None
 */
void ATIM3_Mode0_StcInit(stc_atim3_mode0_init_t *pstcInit)
{
    pstcInit->u32WorkMode         = ATIM3_M0_M0CR_WORK_MODE_TIMER;
    pstcInit->u32CountClockSelect = ATIM3_M0_M0CR_CT_PCLK;
    pstcInit->u32CountMode        = ATIM3_M0_M0CR_MD_32BIT_FREE;
    pstcInit->u32PRS              = ATIM3_M0_M0CR_ATIM3CLK_PRS1;
    pstcInit->u32EnTog            = ATIM3_M0_M0CR_TOG_ON;
    pstcInit->u32EnGate           = ATIM3_M0_M0CR_GATE_OFF;
    pstcInit->u32GatePolar        = ATIM3_M0_M0CR_GATE_POLAR_HIGH;
}
/**
 * @brief  模式1结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_atim3_mode1_init_t
 * @retval None
 */
void ATIM3_Mode1_StcInit(stc_atim3_mode1_init_t *pstcInit)
{
    pstcInit->u32WorkMode         = ATIM3_M1_M1CR_WORK_MODE_PWC;
    pstcInit->u32PRS              = ATIM3_M1_M1CR_ATIM3CLK_PRS1;
    pstcInit->u32CountClockSelect = ATIM3_M1_M1CR_CT_PCLK;
    pstcInit->u32ShotMode         = ATIM3_M1_M1CR_SHOT_CYCLE;
}
/**
 * @brief  模式23结构体初始化
 * @param  [in] pstcInit 初始化结构体 @ref stc_atim3_mode23_init_t
 * @retval None
 */
void ATIM3_Mode23_StcInit(stc_atim3_mode23_init_t *pstcInit)
{
    pstcInit->u32WorkMode         = ATIM3_M0_M0CR_WORK_MODE_TIMER;
    pstcInit->u32CountDir         = ATIM3_M23_M23CR_DIR_UP_CNT;
    pstcInit->u32PRS              = ATIM3_M23_M23CR_ATIM3CLK_PRS1;
    pstcInit->u32CountClockSelect = ATIM3_M23_M23CR_CT_PCLK;
    pstcInit->u32PWMTypeSelect    = ATIM3_M23_M23CR_COMP_PWM_INDEPT;
    pstcInit->u32PWM2sSelect      = ATIM3_M23_M23CR_PWM2S_COMPARE_SINGLE_POINT;
    pstcInit->u32ShotMode         = ATIM3_M23_M23CR_SHOT_CYCLE;
    pstcInit->u32URSSelect        = ATIM3_M23_M23CR_URS_OV_UND_UG_RST;
}

/**
 * @brief  模式1 PWC输入配置初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_pwc_input_init_t
 * @retval None
 */
void ATIM3_Mode1_InputStcInit(stc_atim3_pwc_input_init_t *pstcCfg)
{
    pstcCfg->u32TsSelect  = ATIM3_M1_MSCR_TS_ETR;
    pstcCfg->u32IA0Select = ATIM3_M1_MSCR_IA0S_CH0A;
    pstcCfg->u32IB0Select = ATIM3_M1_MSCR_IB0S_CH0B;
    pstcCfg->u32ETR       = ATIM3_M1_FLTR_ETP_POLARITY_POSITIVE;
    pstcCfg->u32FltETR    = ATIM3_M1_FLTR_FLTA0_B0_ET_NONE;
    pstcCfg->u32FltIA0    = ATIM3_M1_FLTR_FLTA0_B0_ET_NONE;
    pstcCfg->u32FltIB0    = ATIM3_M1_FLTR_FLTA0_B0_ET_NONE;
}

/**
 * @brief  模式23 主从触发配置初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_master_slave_init_t
 * @retval None
 */
void ATIM3_Mode23_MasterSlaveStcInit(stc_atim3_m23_master_slave_init_t *pstcCfg)
{
    pstcCfg->u32MasterSlaveSelect = ATIM3_M23_MSCR_MSM_SLAVE;
    pstcCfg->u32MasterSrc         = ATIM3_M23_MSCR_MMS_TRIG_SOURCE_UG;
    pstcCfg->u32SlaveModeSelect   = ATIM3_M23_MSCR_SMS_INTERNAL_CLK;
    pstcCfg->u32TsSelect          = ATIM3_M23_MSCR_TS_ETFP;
}

/**
 * @brief  模式23 通道0/1/2 CHxB输出设置初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_compare_init_t
 * @retval None
 */
void ATIM3_Mode23_CompareStcInit(stc_atim3_m23_compare_init_t *pstcCfg)
{
    pstcCfg->u32CHxCompareCap       = ATIM3_M23_CRCHx_CSA_CSB_COMPARE;
    pstcCfg->u32CHxCompareModeCtrl  = ATIM3_M23_FLTR_OCMxx_FORCE_LOW;
    pstcCfg->u32CHxPolarity         = ATIM3_M23_FLTR_CCPxx_NORMAL_IN_OUT;
    pstcCfg->u32CHxCompareBufEn     = ATIM3_M23_CRCHx_BUFEx_DISABLE;
    pstcCfg->u32CHxCompareIntSelect = ATIM3_M23_M23CR_CISA_DISABLE_INT;
}

/**
 * @brief  模式23 触发ADC控制初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_adc_trig_init_t
 * @retval None
 */
void ATIM3_Mode23_ADCTrigStcInit(stc_atim3_m23_adc_trig_init_t *pstcCfg)
{
    pstcCfg->bEnTrigADC        = FALSE;
    pstcCfg->bEnUevTrigADC     = FALSE;
    pstcCfg->bEnCH0ACmpTrigADC = FALSE;
    pstcCfg->bEnCH0BCmpTrigADC = FALSE;
    pstcCfg->bEnCH1ACmpTrigADC = FALSE;
    pstcCfg->bEnCH1BCmpTrigADC = FALSE;
    pstcCfg->bEnCH2ACmpTrigADC = FALSE;
    pstcCfg->bEnCH2BCmpTrigADC = FALSE;
}

/**
 * @brief  模式23 通道0/1/2 CHxA输入设置初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_input_init_t
 * @retval None
 */
void ATIM3_Mode23_InputStcInit(stc_atim3_m23_input_init_t *pstcCfg)
{
    pstcCfg->u32CHxCompareCap    = ATIM3_M23_CRCHx_CSA_CSB_COMPARE;
    pstcCfg->u32CHxCaptureSelect = ATIM3_M23_CRCHx_CRxCFx_CAPTURE_EDGE_DISABLE;
    pstcCfg->u32CHxInFlt         = ATIM3_M23_FLTR_FLTxx_NONE;
    pstcCfg->u32CHxPolarity      = ATIM3_M23_FLTR_CCPxx_NORMAL_IN_OUT;
}

/**
 * @brief  模式23 死区功能初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_dt_init_t
 * @retval None
 */
void ATIM3_Mode23_DTStcInit(stc_atim3_m23_dt_init_t *pstcCfg)
{
    pstcCfg->bEnDeadTime      = FALSE;
    pstcCfg->u32DeadTimeValue = 0;
}

/**
 * @brief  模式23 重复周期设置初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_rcr_init_t
 * @retval None
 */
void ATIM3_Mode23_RCRStcInit(stc_atim3_m23_rcr_init_t *pstcCfg)
{
    pstcCfg->u32EnUnderFlowMask = ATIM3_M23_RCR_OVF_INT_EVT_CNT_ENABLE;
    pstcCfg->u32EnOverFLowMask  = ATIM3_M23_RCR_UND_INT_EVT_CNT_ENABLE;
    pstcCfg->u32RepeatCountNum  = 0;
}

/**
 * @brief  模式23 刹车BK输入控制初始化
 * @param  [in] pstcCfg 初始化结构体 @ref stc_atim3_m23_bk_input_init_t
 * @retval None
 */
void ATIM3_Mode23_BKInputStcInit(stc_atim3_m23_bk_input_init_t *pstcCfg)
{
    pstcCfg->u32EnBrake       = ATIM3_M23_DTR_BKE_BRAKE_DISABLE;
    pstcCfg->u32EnVCBrake     = ATIM3_M23_DTR_VCE_BRAKE_DISABLE;
    pstcCfg->u32EnSafetyBk    = ATIM3_M23_DTR_SAFEEN_BRAKE_DISABLE;
    pstcCfg->u32BrakePolarity = ATIM3_M23_FLTR_BKP_NORMAL_IN;
    pstcCfg->u32BrakeFlt      = ATIM3_M23_FLTR_FLTxx_NONE;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
